tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Platform built on V8 to build network applications
brew "node", link: false
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-mono-nerd-font"
